Repository: 84000/data-translation-memory
Catalog: toh184-v2.tmx
Source language: bo
Languages: en

source: འཕགས་པ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Great Vehicle Sūtra Teaching the Practice of a Bodhisattva

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to all buddhas and bodhisattvas.

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་ཡངས་པ་ཅན་ན་ཚལ་ཆེན་པོའི་ཁང་པ་བརྩེགས་པའི་གནས་ན་དགེ་སློང་སྟོང་ཐམ་པའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་ཐམས་ཅད་ཀྱང་དགྲ་བཅོམ་པ།
en: The Blessed One was dwelling at the Kūṭāgāraśālā in the forest outside of Vaiśālī together with a great assembly of one thousand monks.

source: ཟག་པ་ཟད་པ།
en: All of them were worthy ones whose defilements were exhausted.

source: ཉོན་མོངས་པ་མེད་པ། དབང་དང་ལྡན་པར་གྱུར་པ།
en: They were without afflictions and in control.

source: སེམས་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ། ཤེས་རབ་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ།
en: Their minds were perfectly free, and their insight was perfectly liberated.

source: ཅང་ཤེས་པ།
en: They were of noble birth.

source: གླང་པོ་ཆེན་པོ། བྱ་བ་བྱས་པ། བྱེད་པ་བྱས་པ།
en: They were great elephants who had completed their objectives and done what must be done.

source: ཁུར་བོར་བ། བདག་གི་དོན་རྗེས་སུ་ཐོབ་པ།
en: They had laid down their burdens and fulfilled their aims.

source: སྲིད་པར་ཀུན་ཏུ་སྦྱོར་བ་ཡོངས་སུ་ཟད་པ།
en: They had eliminated that which binds to existence.

source: ཡང་དག་པའི་ཤེས་པས་སེམས་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ།
en: Their minds had been perfectly liberated by correct knowledge.

source: སེམས་ཐམས་ཅད་ཀྱི་དབང་གི་དམ་པའི་ཕ་རོལ་ཏུ་སོན་པ།
en: They had obtained supreme perfection in mastering all mental states.

source: སྤྱོད་ལམ་ཞི་བ་དང་། དུལ་བ་དང་། རྣམ་པར་གྲོལ་བ་དང་། མ་བརྟགས་པ་དང་ལྡན་པ་ཤ་སྟག་ལ་འདི་ལྟ་སྟེ།
en: Their behavior was peaceful, disciplined, free, and natural.

source: ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་གང་ཟག་གཅིག་ནི་མ་གཏོགས་ཏེ།
en: The only exception was Venerable Ānanda,

source: དེ་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་ཉམས་སུ་ལེན་པར་བཀའ་སྩལ་ཏེ།
en: but the Blessed One had instructed him in the practice as well, and

source: ཚེ་འདི་ཉིད་ལ་ལུང་བསྟན་པ་དང་།
en: he had been prophesied to become a worthy one in this life.

source: བྱང་ཆུབ་སེམས་དཔའ་སྟོང་ཐམ་པ་ཐམས་ཅད་ཀྱང་ཕྱིར་མི་ལྡོག་པ།
en: Also present were one thousand bodhisattvas. All of them had attained the stage free from regression.

source: ཐམས་ཅད་ཀྱང་གཟུངས་ཐོབ་པ།
en: All of them had obtained retention.

source: ཐམས་ཅད་ཀྱང་མཉམ་པ་ཉིད་ཀྱི་བཟོད་པ་དང་ལྡན་པ།
en: All of them possessed the patience of equanimity.

source: ཐམས་ཅད་ཀྱང་ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་དུ་བྱེད་པའི་ས་ཐོབ་པ།
en: All of them had reached the stage where one practices exactly what has been proclaimed.

source: མཁས་པ། དྲང་པོ། དད་པ་དང་ལྡན་པ།
en: They were wise, honest, and faithful.

source: རྟོག་པ་མང་བ། དང་བ་གཙོ་བོར་བྱེད་པ།
en: They were extremely confident and exceedingly graceful.

source: བཞིན་འཛུམ་པ། ཁྲོ་གཉེར་མེད་པ།
en: They always smiled and never frowned angrily.

source: གཡོ་མེད་པ། བསྒྲུབ་པ་དང་ལྡན་པ།
en: They were steadfast and successful.

source: ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་རྗེས་སུ་རྟོགས་པ།
en: They had realized the nature of phenomena

source: ཆོས་བསྟན་པས་ཡོངས་སུ་མི་སྐྱོ་བ།
en: and never tired of teaching the Dharma.

source: སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཡང་དག་པར་སྐྱེས་པ་ཡོངས་སུ་སྨིན་པར་བྱེད་པ།
en: They had encountered the wisdom of a buddha and were bringing it to full maturity.

source: ལྡེམ་པོ་དག་ལ་ཕྱིན་ཅི་མ་ལོག་པའི་བཟོད་པ་དང་ལྡན་པ།
en: They possessed unerring patience regarding allusive speech.

source: ཡུལ་ཐམས་ཅད་ཕྱིན་ཅི་མ་ལོག་པའི་ས་དང་ལྡན་པ།
en: They had attained the stage of being unmistaken regarding all objects.

source: དུས་ཤེས་པ། ཚོད་ཤེས་པ། སྐབས་ཤེས་པ། རན་པ་ཤེས་པ།
en: They knew the right time, season, occasion, and moment.

source: རྒོད་པ་མེད་པ། ཁེངས་པ་མེད་པ།
en: They were free from agitation and arrogance.

source: སྤྱོད་ལམ་ཐ་མལ་པ་ཕུན་སུམ་ཚོགས་པ།
en: Their behavior was natural and perfect.

source: སྟོང་པ་ཉིད་ཀྱི་ཏིང་ངེ་འཛིན་ལ་མཁས་པ།
en: They were skilled in the meditative absorption on emptiness.

source: འབྱུང་བ་དང་འཇིག་པ་ཡོངས་སུ་སྤངས་པ།
en: They had relinquished arising and disintegration.

source: སྨོན་པ་མེད་པའི་ཏིང་ངེ་འཛིན་དང་ལྡན་པ།
en: They possessed the meditative absorption on wishlessness.

source: འཁོར་བ་ལ་ཡུན་རིང་དུ་སྤྱོད་པ་ལ་ཞུགས་པ།
en: They had practiced bodhisattva conduct in cyclic existence for a long time.

source: མཚན་མ་མེད་པའི་ཏིང་ངེ་འཛིན་དང་ལྡན་པ།
en: They possessed the meditative absorption on signlessness.

source: སྤྲོས་པའི་རྣམ་པ་ཐམས་ཅད་ཀྱི་མཚན་མ་ལེགས་པར་བཟུང་བ།
en: They correctly understood the characteristics of all the content of mental constructs.

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་ལ་མཁས་པ།
en: They were skilled in maturing beings.

source: འདུ་ཤེས་ཐམས་ཅད་དང་བྲལ་བ།
en: They were free from ideation.

source: ཉན་ཐོས་ཀྱི་ཐེག་པ་རྣམ་པར་གཞག་པ་ལ་མཁས་པ།
en: They were skilled in the presentation of the Hearer Vehicle.

source: ཆོས་བསྟན་པ་ཡང་དག་པར་དབྱེ་བར་འཇུག་པར་བྱེད་པ།
en: They engaged in properly distinguishing the teachings of the Dharma.

source: རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་སྟོན་པ།
en: They taught the Solitary Buddha Vehicle.

source: ཉེ་བར་ཞི་བའི་བསྔགས་པ་བརྗོད་པ།
en: They praised tranquility.

source: བྱང་ཆུབ་སེམས་དཔའ་ཡང་དག་པར་སློང་བ།
en: They inspired beings to become bodhisattvas.

source: སྤྱོད་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཞེ་འགྲས་པ་མེད་པར་ཆོས་སྟོན་པ་ཤ་སྟག་ལ་འདི་ལྟ་སྟེ།
en: They behaved appropriately, teaching the Dharma without hatred or animosity.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་དང་། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དང་། སྤོབས་པ་བརྩེགས་པ་དང་། ལག་ན་རིན་ཆེན་ལྡན་དང་། སྤོས་འོད་དང་། མཐའ་ཡས་སྣང་བའི་བློ་གྲོས་དང་། ངན་སོང་སྤོང་དང་། དོན་གྲུབ་སེམས་པ་དང་། ཡོན་ཏན་རྒྱལ་པོ་སྣང་དང་། མྱ་ངན་གྱི་མུན་པ་ཐམས་ཅད་སེལ་བའི་བློ་གྲོས་དང་། མི་མཉམ་པ་ཐམས་ཅད་སྟོན་པ་དང་། དེའི་རང་བཞིན་དུ་མི་གནས་པ་དང་། བློ་མཐའ་ཡས་དང་། བརྩོན་འགྲུས་དང་། རྩལ་བརྟན་པོར་སེམས་པ་དང་། རིན་ཆེན་འབྱུང་གནས་དང་། བཀོད་པའི་རྒྱལ་པོ་དང་། རྣམ་པར་འཕྲུལ་པའི་རྒྱལ་པོ་དང་། འཁྲུལ་པ་མེད་པའི་མཐུ་རྩལ་དང་། ཁྱད་པར་བློ་གྲོས་དང་། ཀུན་ནས་མཛེས་དང་། སྒྲིབ་མེད་སྟོན་དང་། རྣམ་པར་རྩེ་དང་། གསེར་མཆོག་འོད་དཔལ་དང་། ཆོས་ཐམས་ཅད་ལ་རྟག་ཏུ་ལྟ་བའི་བློ་ལྡན་དང་། སྤོས་དྲི་མྱུར་སྦྱིན་མེ་ཏོག་ཀུན་ཏུ་རྒྱས་དང་། གཙོ་བོ་བརྩེགས་དང་། མྱ་ངན་མེད་པའི་དཔལ་དང་། ལྷུན་པོའི་ལྟོ་དང་། སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དང་། སྤོས་ཀྱི་དབང་ཕྱུག་རྒྱལ་པོ་དང་། མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོ་དང་། བློ་མཐའ་ཡས་སྒྲུབ་པ་དང་། དམ་པའི་ཆོས་ཐམས་ཅད་མི་བརྗེད་པར་གནས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེང་གེ་ལྟར་སྒྲ་མངོན་པར་སྒྲོགས་པ་དང་།
en: Among them were the bodhisattva great being Maitreya, Mañjuśrī­kumāra­bhūta, Pratibhānakūṭa, Ratnapāṇi, Gandhaprabha, Ananta­prabhāsamati, Apāyajaha, Siddhārtha­cintin, Guṇa­rāja­prabhāsa, Sarva­śokāndha­kārāpoha­mati, Sarva­viṣamadarśin, Tat­svabhāvā­pratiṣṭhita, Anantamati, Vīrya, Vikrama­saṃdarśa­kacintin, Ratnākara, Vyūharāja, Vikurvāṇarāja, Avyabhicāra­prabhāva, Viśeṣamati, Samanta­prāsādika, Anāvaraṇa­darśin, Vikrīḍamāna, Suvarṇottama­prabhā­śrī, Sarva­dharma­nityadarśana­dhīmat, Āśugandhadāna­kusumita, Jyeṣṭhakūṭa, Aśokaśrī, Merudāra, Avalokiteśvara, Gandheśvara­rāja, Prāmodyarāja, Ananta­mati­pratipatti, Sarvasa­ddharmā­vismaraṇasthita, and the bodhisattva great being Siṃha­nādābhinādin.

source: དེ་དག་དང་བྱང་ཆུབ་སེམས་དཔའ་སྟོང་ཕྲག་མང་པོ་གཞན་དག་དང་ཡང་ཐབས་ཅིག་ཏུ་བཞུགས་སོ། །
en: Also dwelling with them were many thousands of other bodhisattvas.

source: དེ་ནས་བཅོམ་ལྡན་འདས་སྔ་དྲོའི་དུས་ཀྱི་ཚེ་ཤམ་ཐབས་དང་ཆོས་གོས་གསོལ་ཏེ།
en: One morning the Blessed One donned his lower and upper robes,

source: ལྷུང་བཟེད་བསྣམས་ནས་དགེ་སློང་ཉིས་སྟོང་གིས་བསྐོར་ཅིང་མདུན་དུ་བདར་ཏེ་ཡངས་པའི་གྲོང་ཁྱེར་ཆེན་པོར་བསོད་སྙོམས་ལ་གཤེགས་ནས།
en: took up his alms bowl, and went to collect alms in the city of Vaiśālī accompanied and attended by two thousand monks.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཞབས་སྒོའི་ཐེམ་པ་ལ་བཞག་མ་ཐག་ཏུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་གྲོང་ཁྱེར་དུ་གཤེགས་པ་ན་ངོ་མཚར་རྨད་དུ་བྱུང་བའི་ཆོས་རྣམས་འབྱུང་བར་འགྱུར་བ་གང་དག་ཡིན་པ་དེ་དག་བྱུང་སྟེ
en: As soon as the Blessed One placed his foot at the threshold of the city gates, the following wondrous miracles occurred, miracles that occur whenever the blessed buddhas enter a city:

source: ལོང་བ་རྣམས་ནི་མཐོང་བར་གྱུར།
en: blind people gained sight,

source: འོན་པ་རྣམས་ནི་ཐོས་པར་གྱུར།
en: deaf people gained hearing,

source: སྨྱོན་པ་རྣམས་ནི་དྲན་པ་རྙེད་པར་གྱུར་ཏོ། །
en: and the insane regained their senses.

source: ལྷའི་མེ་ཏོག་གི་ཆར་ཡང་བབ་བོ། །སྣང་བ་ཆེན་པོ་ཡང་བྱུང་ངོ་། །
en: A rain of divine flowers fell, a bright light shone,

source: སྲང་ཡང་དྲི་མ་མེད་པར་གྱུར་ཏོ། །
en: and the roads became free of filth.

source: ལྷའི་སིལ་སྙན་ཡིད་དུ་འོང་བ་དག་ཀྱང་མ་བརྡུངས་པར་གྲག་གོ། །
en: The enchanting musical instruments of the gods resounded even without being played.

source: མནར་མེད་པའི་སེམས་ཅན་དམྱལ་བ་ལ་ཐུག་པ་ནས་འོག་མིན་གྱི་གནས་མན་ཆད་ཀྱི་སེམས་ཅན་ཐམས་ཅད་ཀྱང་གཅིག་ཏུ་ངེས་པར་བདེ་བ་དང་ལྡན་པར་གྱུར་ཏོ། །
en: All beings, from the Hell of Uninterrupted Torment up to the Highest Heaven, became completely happy.

source: དེའི་ཚེ་ཡངས་པའི་གྲོང་ཁྱེར་ཆེན་པོ་ན་ལིཙྪ་བཱི་སེང་གེའི་བུ་རིན་ཆེན་བྱིན་ཞེས་བྱ་བ་སྐྱེས་ནས་
en: At that time in the city of Vaiśālī there was a boy named Ratnadatta who had been born as the son of a Licchavi man named Siṃha.

source: ལོ་གསུམ་ལོན་པ་མ་མའི་པང་པ་ན་འདུག་པ་ཁང་བཟངས་ཀྱིས་བརྒྱན་པའི་ཁང་བཟངས་ཀྱི་སྟེང་ན་འདུག་སྟེ
en: The three-year-old was sitting on his mother’s lap on the top floor of their house, and

source: ཁྱེའུ་རིན་ཆེན་བྱིན་གྱིས་རྨད་དུ་བྱུང་བའི་མཚན་མ་དག་མཐོང་ངོ་། །
en: when he witnessed these miraculous signs,

source: དེ་ནས་ཁྱེའུ་རིན་ཆེན་བྱིན་གྱིས་རང་གི་མ་མ་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: the boy Ratnadatta spoke the following verses to his mother:

source: མ་མ་གང་གི་མཐུ་སྟོབས་ཀྱིས། །ཤིན་ཏུ་ཡ་མཚན་བྱུང་བ་སྣང་། །
en: “Mother, whose magical power Has manifested these extraordinary miracles?

source: ཉི་མ་བྱེ་བ་རྣམས་ཀྱི་འོད། །ཟིལ་གནོན་སྣང་འདི་སུ་ཞིག་ཡིན། །
en: This light outshines the radiance Of millions of suns. Whose is it?

source: སྟོང་གསུམ་ས་གཞི་ཁྱབ་གྱུར་ནས།
en: “It pervades the ground of the three-thousand-fold world

source: ངན་འགྲོ་སྐེམས་པར་བྱེད་པ་ཡི། །
en: And dries up the lower realms.

source: རྫུ་འཕྲུལ་སྣང་བ་གང་ཡིན་འདི། །
en: What is this magical light?

source: མ་མ་བདག་ལ་མྱུར་དུ་སྨྲོས། །
en: Quick, Mother, please tell me!

source: དུས་མིན་མེ་ཏོག་ཆར་པ་ཡིས། །སངས་རྒྱས་ཞིང་མཚམས་མེད་པར་མཛེས། །
en: “A rain of unseasonable flowers Continually beautifies this buddha realm,

source: ཕྱོགས་རྣམས་བྱ་ཡི་ཚོགས་རྣམས་ཀྱིས། །སྐད་སྙན་པས་ནི་ཁྱབ་པར་གྱུར། །
en: And everywhere flocks of birds Fill the air with song.

source: སྲང་ཡང་མེ་ཏོག་རྣམས་ཀྱིས་ཁེབས། །
en: “The roads are covered with flowers,

source: མེ་ཏོག་གདུགས་ཀྱང་རྣམ་པར་བྲེས། །
en: The flower parasols unfurled,

source: སྐྱེས་པ་བུད་མེད་དགའ་རྣམས་ཀྱིས། །ཀུན་ནས་རབ་ཏུ་མཛེས་པར་འདུག །
en: And both sides are adorned With happy men and women.

source: ལོང་བ་རྣམས་ཀྱིས་མིག་ཀྱང་ཐོབ། །
en: “Blind people have gained sight,

source: སྐྱེ་བོ་འོན་རྣམས་སྒྲ་ཡང་ཐོས། །
en: Deaf people can hear sounds,

source: བྱད་ངན་བྱད་གཟུགས་ཕུན་སུམ་ཚོགས། །
en: Those who were ugly are now handsome,

source: མདོག་ངན་ཁ་དོག་ཕུན་སུམ་ཚོགས། །
en: Those of poor complexion now have perfect skin,

source: གཡེངས་པ་རྣམས་ཀྱང་དྲན་པ་རྙེད། །
en: “The bewildered have regained their senses,

source: ལྕེ་མེད་ཚིག་ནི་རྣམ་པར་དག །
en: The mute can speak clearly,

source: སེམས་ཅན་བྱམས་པའི་སེམས་མེད་པ། །བྱམས་པའི་སེམས་དང་ལྡན་པར་གྱུར། །
en: And beings who had no love in their hearts Are now filled with love.

source: མ་མ་སེམས་ཅན་ཁྱད་པར་ཅན། །
en: “Quick, Mother, tell me,

source: རྫུ་འཕྲུལ་གྲུབ་པ་མཐུ་ལྡན་པ། །
en: Who is this extraordinary being

source: འཇིག་རྟེན་དག་ན་རྒྱུ་བ་འདི། །
en: Who moves throughout the worlds

source: སུ་ཡིན་བདག་ལ་མྱུར་དུ་སྨྲོས། །
en: With the power to perform such miracles?”

source: དེ་ནས་ཁྱེའུ་རིན་ཆེན་བྱིན་གྱི་མ་མས་ཁྱེའུ་རིན་ཆེན་བྱིན་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: Ratnadatta’s mother answered him in the following verses:

source: རྣམ་པར་དག་པ་སྤྱོད་མཆོག་ལྡན། །
en: “He is a pure being with supreme conduct,

source: རྒྱལ་བ་དྲི་མེད་བློ་མི་དམན། །
en: A stainless victor without harmful intent

source: བསམ་ཡས་མ་ལུས་ཡོངས་སུ་དག །
en: Who is beyond thought and utterly pure.

source: དབང་ལྡན་ཡོན་ཏན་རིན་ཆེན་འཕགས། །
en: He is powerful, exalted in precious virtues.

source: འཇིག་རྟེན་མགོན་པོ་འཁྲ་ས་མིག །
en: “He is the world’s protector, refuge, and guide.

source: དེ་བཞིན་གཤེགས་པ་རྩ་ལག་འདི། །
en: This is our kinsman, the Thus-Gone One,

source: བློ་ལྡན་བསོད་སྙོམས་དོན་དུ་གཤེགས། །
en: A wise man come to beg alms

source: འཇིག་རྟེན་ཆོས་ལ་རྟེན་པ་མེད། །
en: Who does not adhere to worldly duty.

source: འདི་ལ་སྡུག་དང་མི་སྡུག་སོགས། །འཇིག་རྟེན་པ་ཡི་རྟོག་མི་མངའ། །
en: “He does not entertain mundane thoughts Such as pleasant or unpleasant.

source: པད་མ་ཆུ་ལས་སྐྱེས་པ་ལྟར། །མངའ་བདག་མི་གོས་སྤྱོད་པར་མཛད། །
en: The lord engages in conduct without being stained, Like a lotus born from the water.

source: བློ་གྲོས་ལྡན་པ་ཐེ་ཙོམ་གཅོད། །
en: “This intelligent one eliminates doubt.

source: ཕན་མཛད་ཐུགས་རྗེར་ལྡན་པ་སྟེ། །
en: He benefits beings and is compassionate.

source: འགྲོ་བའི་སྡུག་བསྔལ་བསལ་བའི་ཕྱིར། །
en: To dispel the suffering of beings.

source: རྣམ་པར་འདྲེན་པ་འདིར་གཤེགས་སོ། །
en: Now this leader has come here

source: བསྟོད་ཀྱང་དགྱེས་པར་མི་འགྱུར་ལ། །
en: “Praise does not delight him,

source: སྨད་ཀྱང་འཁྲུག་པར་མི་འགྱུར་ཏེ། །
en: And blame does not upset him.

source: ཁོང་ཁྲོ་རྗེས་སུ་ཆགས་པ་སྤངས། །
en: He has abandoned anger and attachment

source: ཆགས་མེད་རྒྱུ་བ་རླུང་དང་འདྲ། །
en: And moves freely, like the wind.

source: འདི་ནི་ཆོས་རྒྱལ་དམ་པ་སྟེ། །
en: “He is a sublime dharma king

source: ཡེ་ཤེས་ཟབ་མོ་ཕུན་སུམ་ཚོགས། །
en: Who has mastered profound wisdom

source: དོན་དམ་དོན་ལ་མཁས་པ་པོ། །
en: And is learned in the ultimate meaning—

source: འགྲོ་བའི་སློབ་དཔོན་གཤེགས་པ་ཡིན། །
en: The teacher of beings has come.

source: དེ་ནི་དབུ་མ་སྟོན་པ་སྟེ། །
en: “He teaches the middle way

source: ཡོད་མེད་འཛིན་ལས་རྣམ་པར་གྲོལ། །
en: That is free from grasping at existence or nonexistence.

source: ཆོས་ལམ་ལྡན་ཞིང་ཞི་བ་སྟེ། །
en: He possesses the path of Dharma and is peaceful.

source: བརྟེན་པ་ཐམས་ཅད་ཡོངས་སུ་སྤངས། །
en: He has abandoned all types of dependence.

source: ཡེ་ཤེས་ཕུང་པོ་བདག་མེད་བདག །
en: “The one for whom wisdom is the aggregates’ lack of self,

source: བསོད་ནམས་ཚོགས་རྣམས་བསྩགས་པ་ཡི། །
en: Who has gathered the accumulation of merit,

source: བདེ་གཤེགས་འཇིག་རྟེན་འདྲེན་པ་པོ། །
en: The blissful one, the guide of the world

source: མཐའ་ཡས་གཟུགས་ཅན་དེང་གཤེགས་སོ། །
en: Whose form is boundless, has come today!

source: དབུ་སྐྲ་གཡས་སུ་འཁྱིལ་པར་གནས། །
en: “His hair is coiled to the right

source: འཇམ་ཞིང་མདོག་སྣུམ་ལྕང་ལོ་ཅན། །
en: And is soft, shiny, and curly.

source: གནག་ཅིང་འཛིངས་པ་མེད་རྣམས་ཀྱིས། །
en: It is black, not matted,

source: དེ་ཡི་དབུ་ནི་རྣམ་པར་མཛེས། །
en: And perfectly adorns his head.

source: གཙུག་ཏོར་གཡས་སུ་འཁྱིལ་པ་སྟེ། །
en: “His crown protuberance circles to the right,

source: དབུ་སྐྲ་འཁྱིལ་ཞིང་ལེགས་པར་གནས། །
en: Its hair is coiled, and it is perfectly placed.

source: རི་རབ་རྩེ་མོ་འདྲ་བར་ནི། །
en: It resembles the peak of Mt. Meru—

source: དེ་ཡི་དབྱིབས་ནི་མཛེས་པ་ཡིན། །
en: So beautiful is its shape.

source: དེ་ཡི་སྨིན་མཚམས་མཛོད་སྤུ་མཛེས། །
en: “The middle of his brow is adorned with a curled hair

source: འཇམ་ཞིང་གཡས་སུ་འཁྱིལ་བ་སྟེ། །
en: That is smooth and turns to the right.

source: འོད་ནི་ཤེལ་དང་ཟླ་བ་ཡི། །
en: Its radiance is far brighter than a lattice

source: འོད་ཟེར་དྲ་བ་མང་བས་ལྷག །
en: Of pure crystal lunar rays.

source: དེ་ཡི་ཞལ་ནས་སྤྱན་མཛེས་པ། །
en: “His eyes are beautiful

source: མེ་ཏོག་ཨུཏ་པལ་སྔོན་པོ་འདྲ། །
en: Like blue lotus flowers.

source: བ་ཡི་རྫི་མ་ཡོངས་སུ་དག །
en: He has perfect eyelashes like a cow.

source: མི་དམར་མ་འཛིངས་ཞི་བར་གཟིགས། །
en: He has a peaceful gaze without redness or agitation.

source: དཔལ་ལྡན་སེང་གེའི་འགྲམ་པ་འདྲ། །
en: “He has a jaw like a glorious lion,

source: དེ་ནི་རྟག་ཏུ་ཞལ་ཡང་འཛུམ། །
en: And he always has a smile on his face.

source: སྒྲོས་ནི་བིམ་པ་བཞིན་དུ་དམར། །
en: His lips are red like a bimba fruit,

source: ཞལ་མཛེས་ལུས་ཅན་ཀུན་འདྲེན་པ། །
en: His beautiful face attracts all embodied beings.

source: མཐུ་སྟོབས་ཆེན་པོ་ཕུན་སུམ་ཚོགས། །
en: “He has an abundance of great power and strength,

source: བསོད་ནམས་བརྒྱ་ཡི་སྟོབས་མངའ་བ། །
en: The strength of hundreds of merits.

source: ཚེམས་ཀྱི་ཕྲེང་བ་སྤ་བའི་འོད། །
en: The rows of his teeth have a beautiful shine,

source: སྙོམས་ཤིང་ཐགས་བཟང་ཡོངས་སུ་དག །
en: And they are even and perfectly spaced.

source: དེ་ཡི་ཚེམས་ནི་ཤིན་ཏུ་དཀར། །
en: “His teeth are pure white.

source: ལྗགས་ནི་ཤིན་ཏུ་རིང་ཞིང་སྲབ། །
en: His tongue is very long and thin,

source: བདག་ཉིད་ཀྱི་ནི་ཞལ་གྱི་ངོས། །
en: And with it he can completely cover

source: དེ་ཡིས་ཀུན་ཏུ་ཁྱབ་པར་གནས། །
en: The surface of his own face.

source: དཔལ་ལྡན་དབུ་ནི་གདུགས་དང་འདྲ། །
en: “The head of the glorious one is like a parasol.

source: དེ་བཞིན་དེ་ནི་ཤངས་ཀྱང་མཐོ། །
en: Likewise, his nose is prominent,

source: མདོག་ནི་བཙོ་མའི་གསེར་དང་འདྲ། །
en: His complexion is like refined gold,

source: དེ་ཡི་ཞལ་གྱི་འཕྲལ་བ་མཛེས། །
en: And he has a beautiful forehead.

source: དེ་ཡི་ཞལ་གྱི་སྨིན་ཚུགས་ནི། །
en: “His eyebrows are very pleasant

source: ཁ་དོག་མཐོན་མཐིང་ཤིན་ཏུ་སྡུག །
en: And the color of blue sapphire.

source: ཞི་བའི་སྤྱན་ནི་མཛེས་པ་སྟེ། །
en: His peaceful eyes are beautiful

source: སྙན་གྱི་དྲུང་དུ་ཐུག་པར་གནས། །
en: And extend toward his ears.

source: སྙན་ཤལ་རིང་ལ་རབ་ཏུ་འཕྱང་། །
en: “His earlobes are long and dangling.

source: ཞལ་མཛེས་སྟོན་གྱི་ཟླ་བས་ལྷག །
en: His face is more beautiful than an autumn moon

source: ཞལ་རས་པད་མ་རྣམ་དག་འདྲ། །
en: And resembles a perfectly pure lotus.

source: ཞལ་མདངས་དཀར་ལ་དང་ཞིང་གསལ། །
en: It is radiant, pure, and clear.

source: བརྟན་པོ་ཚངས་པའི་སྒྲ་སྐད་ལྡན། །
en: “His speech is steady and eloquent,

source: དེ་གསུང་ཀ་ལ་པིང་ཀའི་འདྲ། །
en: And his voice is kind, pleasing,

source: དེ་ཡི་གསུང་བཟང་ཡིད་དུ་འོང་། །
en: And soft; it satisfies beings

source: འཇམ་ཞིང་སེམས་ཅན་ཚིམ་པར་བྱེད། །
en: Like the call of a sparrow.

source: རྨ་བྱ་ངང་པ་མིའམ་ཅི། །
en: “The sound of a peacock, A swan, a kinnara,

source: ནེ་ཙོ་རི་སྐེགས་ཁུ་བྱུག་དང་། །
en: A parrot, a myna, and a cuckoo,

source: འབྲུག་སྒྲ་ཁྲུང་ཁྲུང་ཀུ་ན་ལ། །
en: Of thunder, a crane,

source: ཤང་ཤང་ཏེའུ་དང་གླིང་བུ་དང་། །རྫ་རྔའི་སྒྲ་དང་གཞན་དག་ཀྱང་། །
en: “A pheasant, a flute, the beat Of a clay drum; and anything else,

source: སྒྲ་སྐད་སྙན་པ་ཅི་ཡང་རུང་། །དེ་དག་དེ་བཞིན་གཤེགས་པ་ཡི། །གསུང་གི་བཅུ་དྲུག་ཆར་མི་ཕོད། །
en: However pleasant, does not match a sixteenth Of the voice of the Thus-Gone One.

source: སྐུལ་མཛད་དེ་བཞིན་མཉེན་པ་སྟེ། །
en: “It is inspiring, yet soft.

source: དེ་ནི་སྙན་ཅིང་འཇམ་པ་དང་། །
en: It is sweet and gentle,

source: ཡིད་འོང་དགའ་བྱེད་གསལ་བ་སྟེ། །
en: Endearing, pleasing, and clear.

source: སྐྱོན་དང་བྲལ་ཞིང་འཇིགས་པ་མེད། །
en: It is flawless and fearless.

source: རེ་བ་རྣམས་ལ་ཆར་རྒྱུན་ལྟར། །
en: “Like a steady rain for the hopeful,

source: སེམས་རྒྱུན་ཚིམ་པར་བྱེད་ལ་ཞི། །
en: It satisfies and pacifies the mind.

source: མ་ཉམས་མ་འཁྲུལ་རབ་ཏུ་ཞི། །
en: It is uncorrupted, unmistaken, perfectly peaceful,

source: དེ་བཞིན་དག་ཅིང་བརྡ་ཕྲད་སླ། །
en: Pure, and also easy to comprehend.

source: སྐལ་དང་ལྡན་ཞིང་སྙན་པར་ལྡན། །
en: “It is auspicious, sweet,

source: དོན་དང་ཡོན་ཏན་ཐམས་ཅད་ཚོགས། །
en: Meaningful, and possesses all good qualities.

source: གསུང་གི་རྒྱན་རྣམས་ཕུན་སུམ་ཚོགས། །
en: His poetic embellishments are perfect.

source: དེ་ཡི་གསུང་ནི་དགེ་སྐྱེད་པ། །
en: His speech inspires virtue.

source: སེམས་ཅན་མོས་པ་ཐ་དད་དང་། །
en: “Beings with different inclinations And

source: དེ་བཞིན་ངེས་ཚིག་ཐ་དད་རྣམས། །
en: different interpretations

source: དེ་ཡི་གསུང་ལ་ངེས་པར་དད། །
en: Have faith in what he says

source: ཡིད་ཀྱང་རབ་ཏུ་དགའ་བར་འགྱུར། །
en: And become exceedingly happy.

source: དེས་ནི་ཕྱོགས་བཅུའི་འཇིག་རྟེན་ཁམས། །
en: In the world systems of the ten directions,

source: གནས་པའི་སེམས་ཅན་གསུང་གིས་ཁྱབ། །
en: “His voice reaches all beings who abide

source: མགོན་པོ་དེ་ཡི་གསུང་ཚིག་ནི། །
en: And the words of the protector

source: སེམས་ཅན་རྣམས་ལ་དོན་ཡོད་འཇུག །
en: Are rendered meaningful to all those beings.

source: ཐུབ་པ་སྐྱེས་མཆོག་དེ་ཡི་ནི། །མགུར་ཡང་དུང་འདྲ་དཔུང་མགོ་ཟླུམ། །
en: “That sage, supreme among beings, Has a neck like a conch and round shoulders.

source: དེ་ཡི་ཐལ་གོང་རྒྱས་པ་སྟེ། །
en: He is broad chested,

source: དེ་ནི་བདུན་པོ་མཐོ་བ་མངའ། །
en: And the seven parts of his body are prominent.

source: དེ་ཡི་ཕྱག་ཀྱང་རབ་ཏུ་རིང་། །
en: “His arms are very long,

source: པགས་པ་གསེར་མདོག་འདྲ་བ་སྟེ། །
en: His skin the color of gold.

source: གསེར་གྱི་སྡོང་པོ་བཞིན་དུ་མཐོ། །
en: He is as tall as the wish-fulfilling tree,

source: ནྱ་གྲོ་ད་ལྟར་ཆུ་ཞེང་གབ། །
en: His girth like a banyan.

source: ཐུགས་ཀ་དཔལ་གྱི་བེའུས་བརྒྱན། །
en: “His chest is adorned with the endless knot.

source: འཁོར་ལོའི་མཚན་ཅན་པད་མའི་ཕྱག །
en: His lotus hands bear the imprints of a wheel.

source: ཤིང་བལ་འདབ་ལྟར་རེག་ན་འཇམ། །
en: They are soft to the touch like cotton or flower petals,

source: དེ་ཡི་ཕྱག་གི་སོར་མོ་རིང་། །
en: And their fingers are long.

source: སྤུ་རྣམས་རེ་རེར་སྐྱེས་ཤིང་ཡར་ཕྱོགས་སྟུག་ལ་འཇམ། །
en: “Each body hair is present, upright, thick, and soft.

source: བྲང་གི་ཕེལ་ཀ་ཆེ་ལ་རབ་རྒྱས་ལྟེ་བ་ཟབ། །
en: His torso is broad and his navel is deep.

source: ཕྱལ་དབྱིབས་གཞུ་འདྲ་གླང་ཆེན་བཞིན་དུ་སྦུབས་སུ་ནུབ། །
en: His belly is the shape of a bow, and his genitals are retracted in a sheath like an elephant.

source: རྗེ་ངར་ཨེ་ནེ་ཡ་འདྲ་མདངས་དཀར་འདམ་བུའི་སྦུབས། །
en: He has calves like an antelope and with a white hue like the inside of a reed.

source: ལོང་བུ་མི་མངོན་དེ་ཡི་རྟིང་པ་ལེགས་པར་གྲུབ། །
en: “His ankle bones do not protrude, and his heels are well shaped.

source: དེ་བཞིན་དྲང་སྲོང་སོར་མོ་རིང་ཞིང་སེན་མོ་དམར། །
en: The sage’s fingers are long and his nails are red.

source: བདེ་བར་གཤེགས་ཀྱི་ཞབས་ཀྱི་ལོང་བུ་མི་མངོན་ཏེ། །
en: The soles of the Blissful One’s feet are not arched,

source: འཁོར་ལོ་ལྕགས་ཀྱུ་བཀྲ་ཤིས་ལྡན་དང་དུང་གིས་སྤྲས། །
en: And they are adorned with wheels, hooks, svastikas, and conches.

source: མགོན་པོ་དེ་ཡི་ཞབས་གཉིས་མཉམ་ཞིང་ལེགས་གནས་དང་། །
en: “The Lord’s feet are of equal proportion and steady.

source: ཤིང་བལ་བཞིན་དུ་རེག་ན་འཇམ་ཞིང་བཟང་བ་དང་། །
en: They are soft and pleasing to the touch like cotton.

source: མེ་ཏོག་ཨུཏ་པལ་དམར་པོ་ལེགས་པར་སྐྱེས་པ་ཡི། །
en: Their color is like a blooming red lotus,

source: ཁ་དོག་འདྲ་བས་ས་གཞི་དག་ལ་གཤེགས་པར་མཛད། །
en: And with them he traverses the worlds.

source: དེ་བཞིན་གཤེགས་པ་སེང་གེའི་སྒྲ་སྒྲོགས་བདེ་སྦྱིན་པ། །
en: “The lion’s roar of the Thus-Gone One bestows happiness.

source: འགྲོ་བ་རྣམས་ཀྱི་གཙོ་བོ་དེ་ནི་འདིར་གཤེགས་ཏེ། །
en: This chief among beings has now arrived here,

source: ཡོང་གིས་འཇིགས་པ་མེད་པར་སེང་གེའི་སྒྲ་སྐད་ཀྱིས། །
en: And the lack of mental constructs with the fearless roar of a lion.”

source: གཉིས་སུ་མེད་ཅིང་སྤྲོས་པ་མེད་པའི་ཆོས་ཀྱང་སྟོན། །
en: And when he comes, he teaches the Dharma of nonduality

source: དེ་ནས་ཁྱེའུ་རིན་ཆེན་བྱིན་གྱིས་བདག་གི་མ་མ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Then the boy Ratnadatta said to his mother,

source: མ་མ་བདག་སྐར་ཁུང་འདིར་ཞོག་ཤིག་དང་། དེ་བཞིན་གཤེགས་པ་བལྟའོ། །
en: “Mother, put me in the window so I can see the Thus-Gone One,”

source: དེ་ནས་མ་མ་དེས་ཁྱེའུ་རིན་ཆེན་བྱིན་སྐར་ཁུང་དུ་བཞག་གོ། །
en: so his mother sat him in the window.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཁྱེའུ་རིན་ཆེན་བྱིན་གྱི་སེམས་ཀྱི་ཡོངས་སུ་རྟོག་པ་ཐུགས་ཀྱིས་མཁྱེན་ནས་སྲང་དེ་ཁོ་ནར་གཤེགས་སོ། །
en: The Blessed One knew what Ratnadatta was thinking, so he walked right down his street.

source: ཁྱེའུ་རིན་ཆེན་བྱིན་གྱིས་ཀྱང་བཅོམ་ལྡན་འདས་གཤེགས་པ་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་དེ་འདི་སྙམ་དུ་སེམས་ཏེ། །
en: When the boy saw the Blessed One walking he thought,

source: གང་དག་དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་ཐམས་ཅད་དང་ལྡན་པ་འདི་ལྟ་བུ་མཐོང་ནས་
en: “Whoever sees the Thus-Gone One, who possesses all good qualities, and

source: བྱང་ཆུབ་ཀྱི་སེམས་སྐྱེད་པར་མི་བྱེད་པ་དེ་དག་ནི་རྙེད་པ་ཉེས་པར་རྙེད་པའོ་སྙམ་མོ། །
en: does not generate the mind of awakening is indeed unfortunate.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཁྱེའུ་རིན་ཆེན་བྱིན་གྱི་སྒོ་དྲུང་དུ་གཤེགས་སོ། །
en: The Blessed One proceeded right up to Ratnadatta’s door

source: དེ་ནས་ཁྱེའུ་རིན་ཆེན་བྱིན་འདི་སྙམ་དུ་སེམས་ཏེ།
en: and the boy thought,
